<?php

//配置文件  游戏内支付场景参考
//该配置为游戏服务器配置，并非支付系统配置(支付系统配置在api/Xpay.php)，请根据实际情况修改。
//↓↓↓↓↓↓↓↓↓↓请在这里配置您的基本信息↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓

 $host = "192.168.2.11";//本地连接数据库 一般不修改
 $db_user = "root";//数据库用户名 一般不修改
 $db_passwd = "********";//你的游戏数据库密码
 $db_port = "3307";//数据库端口  一般不修改

$yxm ="冰雪传奇";
//你的游戏名字
$bili = "1"; // 写2 就是双倍领取! 卷死他们

//↑↑↑↑↑↑↑↑↑↑请在这里配置您的基本信息↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑


$pfid = '10003';//因版本而异. 最好对接好后测试一下每一笔充值
$db = array(
    "s1"=>"actor_c1001", //一区角色所在数据库
	"s2"=>"actor_c1002", //二区
);

 $wupin = array(
    "10"=>"com.game191.icelegend10", 
	"30"=>"com.game191.icelegend30", 
	"50"=>"com.game191.icelegend50", 
	"100"=>"com.game191.icelegend100", 
	"300"=>"com.game191.icelegend300", 
	"500"=>"com.game191.icelegend500", 
	"1000"=>"com.game191.icelegend1000", 
	"3000"=>"com.game191.icelegend3000", 
);
